DanielMilanez/SistemasEmbarcados/Microcontroladores/STM32/Projetos/Projeto Comunicate SERVO MASTER - S/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define M8x8_Green8_Pin GPIO_PIN_1
#define M8x8_Green8_GPIO_Port GPIOC
#define M8x8_Green4_Pin GPIO_PIN_0
#define M8x8_Green4_GPIO_Port GPIOA
#define M8x8_Green5_Pin GPIO_PIN_1
#define M8x8_Green5_GPIO_Port GPIOA
#define M8x8_Green7_Pin GPIO_PIN_4
#define M8x8_Green7_GPIO_Port GPIOA
#define D4_Pin GPIO_PIN_5
#define D4_GPIO_Port GPIOA
#define D5_Pin GPIO_PIN_6
#define D5_GPIO_Port GPIOA
#define D6_Pin GPIO_PIN_7
#define D6_GPIO_Port GPIOA
#define M8x8_Green3_Pin GPIO_PIN_4
#define M8x8_Green3_GPIO_Port GPIOC
#define M8x8_Red1_Pin GPIO_PIN_5
#define M8x8_Red1_GPIO_Port GPIOC
#define M8x8_Green6_Pin GPIO_PIN_0
#define M8x8_Green6_GPIO_Port GPIOB
#define M8x8_Red7_Pin GPIO_PIN_1
#define M8x8_Red7_GPIO_Port GPIOB
#define M8x8_Red6_Pin GPIO_PIN_2
#define M8x8_Red6_GPIO_Port GPIOB
#define M8x8_S3_Pin GPIO_PIN_10
#define M8x8_S3_GPIO_Port GPIOB
#define M8x8_Red5_Pin GPIO_PIN_11
#define M8x8_Red5_GPIO_Port GPIOB
#define M8x8_Red4_Pin GPIO_PIN_12
#define M8x8_Red4_GPIO_Port GPIOB
#define M8x8_Green2_Pin GPIO_PIN_13
#define M8x8_Green2_GPIO_Port GPIOB
#define M8x8_Green1_Pin GPIO_PIN_14
#define M8x8_Green1_GPIO_Port GPIOB
#define M8x8_Red8_Pin GPIO_PIN_15
#define M8x8_Red8_GPIO_Port GPIOB
#define M8x8_S8_Pin GPIO_PIN_6
#define M8x8_S8_GPIO_Port GPIOC
#define M8x8_S1_Pin GPIO_PIN_7
#define M8x8_S1_GPIO_Port GPIOC
#define M8x8_S7_Pin GPIO_PIN_8
#define M8x8_S7_GPIO_Port GPIOC
#define RS_Pin GPIO_PIN_9
#define RS_GPIO_Port GPIOC
#define M8x8_S2_Pin GPIO_PIN_8
#define M8x8_S2_GPIO_Port GPIOA
#define M8x8_Red3_Pin GPIO_PIN_11
#define M8x8_Red3_GPIO_Port GPIOA
#define M8x8_Red2_Pin GPIO_PIN_12
#define M8x8_Red2_GPIO_Port GPIOA
#define M8x8_S6_Pin GPIO_PIN_3
#define M8x8_S6_GPIO_Port GPIOB
#define M8x8_S4_Pin GPIO_PIN_4
#define M8x8_S4_GPIO_Port GPIOB
#define M8x8_S5_Pin GPIO_PIN_5
#define M8x8_S5_GPIO_Port GPIOB
#define D7_Pin GPIO_PIN_6
#define D7_GPIO_Port GPIOB
#define RW_Pin GPIO_PIN_8
#define RW_GPIO_Port GPIOB
#define EN_Pin GPIO_PIN_9
#define EN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
